channel_number:  16
dataset:  amazon
Train Shapes
(1255968, 200)
(1255968, 1255968)
(1255968, 107)
(1569960,)
Val Shapes
(78498, 200)
(78498, 78498)
(78498, 107)
(1569960,)
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 200)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 200)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 1569960)]    0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 16)           3200        dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 16)           0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 107)          1712        dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 4,912
Trainable params: 4,912
Non-trainable params: 0
__________________________________________________________________________________________________
(1569960, 200)
(1569960, 1569960)
(1569960, 107)
(1569960,)
Epoch 1/600
1/1 [==============================] - ETA: 0s - loss: 8925.9102 - acc: 0.0139
Epoch 00001: saving model to training_16_amazon/cp.ckpt
1/1 [==============================] - 1s 626ms/step - loss: 8925.9102 - acc: 0.0139 - val_loss: 161.1759 - val_acc: 0.0161
Epoch 2/600
1/1 [==============================] - ETA: 0s - loss: 8647.8857 - acc: 0.0134
Epoch 00002: saving model to training_16_amazon/cp.ckpt
1/1 [==============================] - 0s 448ms/step - loss: 8647.8857 - acc: 0.0134 - val_loss: 156.8011 - val_acc: 0.0168
Epoch 3/600
1/1 [==============================] - ETA: 0s - loss: 7690.6538 - acc: 0.0153
Epoch 00003: saving model to training_16_amazon/cp.ckpt
1/1 [==============================] - 0s 387ms/step - loss: 7690.6538 - acc: 0.0153 - val_loss: 152.7520 - val_acc: 0.0176
Epoch 4/600
1/1 [==============================] - ETA: 0s - loss: 7844.6260 - acc: 0.0145
Epoch 00004: saving model to training_16_amazon/cp.ckpt
1/1 [==============================] - 0s 393ms/step - loss: 7844.6260 - acc: 0.0145 - val_loss: 148.7509 - val_acc: 0.0186
Epoch 5/600
1/1 [==============================] - ETA: 0s - loss: 7327.1260 - acc: 0.0160
Epoch 00005: saving model to training_16_amazon/cp.ckpt
1/1 [==============================] - 0s 381ms/step - loss: 7327.1260 - acc: 0.0160 - val_loss: 144.8783 - val_acc: 0.0195
Epoch 6/600
1/1 [==============================] - ETA: 0s - loss: 6627.6851 - acc: 0.0255
Epoch 00006: saving model to training_16_amazon/cp.ckpt
1/1 [==============================] - 0s 387ms/step - loss: 6627.6851 - acc: 0.0255 - val_loss: 141.1604 - val_acc: 0.0204
Epoch 7/600
1/1 [==============================] - ETA: 0s - loss: 6302.3545 - acc: 0.0211
Epoch 00007: saving model to training_16_amazon/cp.ckpt
1/1 [==============================] - 0s 386ms/step - loss: 6302.3545 - acc: 0.0211 - val_loss: 137.6283 - val_acc: 0.0216
