Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (2048, 2048)
TEST INDEX SHAPE AFTER SPLICE: (2048, 602)
  (0, 664)	1.0
  (1, 1038)	1.0
  (2, 501)	1.0
  (2, 1799)	1.0
  (5, 1857)	1.0
  (6, 97)	1.0
  (6, 1540)	1.0
  (7, 1607)	1.0
  (9, 74)	1.0
  (9, 1563)	1.0
  (10, 1018)	1.0
  (11, 1018)	1.0
  (13, 739)	1.0
  (13, 1562)	1.0
  (16, 108)	1.0
  (16, 109)	1.0
  (16, 125)	1.0
  (16, 486)	1.0
  (16, 506)	1.0
  (16, 604)	1.0
  (16, 630)	1.0
  (16, 632)	1.0
  (16, 796)	1.0
  (16, 908)	1.0
  (16, 1142)	1.0
  :	:
  (2035, 984)	1.0
  (2035, 1563)	1.0
  (2036, 293)	1.0
  (2036, 376)	1.0
  (2036, 677)	1.0
  (2036, 695)	1.0
  (2036, 997)	1.0
  (2036, 1018)	1.0
  (2036, 1077)	1.0
  (2036, 1365)	1.0
  (2036, 1823)	1.0
  (2037, 311)	1.0
  (2038, 785)	1.0
  (2038, 903)	1.0
  (2038, 1661)	1.0
  (2040, 48)	1.0
  (2040, 877)	1.0
  (2040, 1511)	1.0
  (2041, 708)	1.0
  (2041, 1100)	1.0
  (2041, 1222)	1.0
  (2041, 2019)	1.0
  (2042, 357)	1.0
  (2045, 184)	1.0
  (2045, 1896)	1.0
M:  2048
overall time:  0.17472481727600098
