Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (4096, 4096)
TEST INDEX SHAPE AFTER SPLICE: (4096, 602)
  (0, 664)	1.0
  (0, 2081)	1.0
  (0, 2163)	1.0
  (0, 3360)	1.0
  (0, 3365)	1.0
  (0, 3760)	1.0
  (1, 1038)	1.0
  (2, 501)	1.0
  (2, 1799)	1.0
  (2, 2819)	1.0
  (3, 2294)	1.0
  (5, 1857)	1.0
  (5, 2258)	1.0
  (5, 2303)	1.0
  (6, 97)	1.0
  (6, 1540)	1.0
  (6, 3402)	1.0
  (6, 3944)	1.0
  (7, 1607)	1.0
  (7, 3273)	1.0
  (8, 2109)	1.0
  (8, 2995)	1.0
  (9, 74)	1.0
  (9, 1563)	1.0
  (9, 2513)	1.0
  :	:
  (4087, 2508)	1.0
  (4087, 3170)	1.0
  (4087, 3922)	1.0
  (4088, 2797)	1.0
  (4089, 1557)	1.0
  (4089, 3415)	1.0
  (4089, 3913)	1.0
  (4090, 121)	1.0
  (4090, 269)	1.0
  (4090, 561)	1.0
  (4090, 643)	1.0
  (4090, 1095)	1.0
  (4090, 1218)	1.0
  (4090, 1525)	1.0
  (4090, 1871)	1.0
  (4090, 2081)	1.0
  (4090, 3302)	1.0
  (4090, 3315)	1.0
  (4092, 2937)	1.0
  (4093, 132)	1.0
  (4093, 999)	1.0
  (4093, 3512)	1.0
  (4093, 4001)	1.0
  (4094, 1775)	1.0
  (4095, 827)	1.0
M:  4096
overall time:  0.254117488861084
