Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (1024, 1024)
TEST INDEX SHAPE AFTER SPLICE: (1024, 602)
  (0, 664)	1.0
  (2, 501)	1.0
  (6, 97)	1.0
  (9, 74)	1.0
  (10, 1018)	1.0
  (11, 1018)	1.0
  (13, 739)	1.0
  (16, 108)	1.0
  (16, 109)	1.0
  (16, 125)	1.0
  (16, 486)	1.0
  (16, 506)	1.0
  (16, 604)	1.0
  (16, 630)	1.0
  (16, 632)	1.0
  (16, 796)	1.0
  (16, 908)	1.0
  (17, 91)	1.0
  (18, 726)	1.0
  (22, 135)	1.0
  (22, 193)	1.0
  (22, 721)	1.0
  (25, 884)	1.0
  (28, 184)	1.0
  (28, 193)	1.0
  :	:
  (997, 343)	1.0
  (1000, 827)	1.0
  (1000, 870)	1.0
  (1000, 1013)	1.0
  (1001, 538)	1.0
  (1002, 558)	1.0
  (1005, 168)	1.0
  (1006, 968)	1.0
  (1009, 384)	1.0
  (1009, 417)	1.0
  (1009, 783)	1.0
  (1013, 1000)	1.0
  (1014, 610)	1.0
  (1016, 282)	1.0
  (1018, 10)	1.0
  (1018, 11)	1.0
  (1018, 412)	1.0
  (1018, 464)	1.0
  (1018, 490)	1.0
  (1018, 527)	1.0
  (1018, 532)	1.0
  (1020, 846)	1.0
  (1023, 323)	1.0
  (1023, 465)	1.0
  (1023, 599)	1.0
M:  1024
overall time:  0.11820054054260254
