Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (8192, 8192)
TEST INDEX SHAPE AFTER SPLICE: (8192, 602)
  (0, 664)	1.0
  (0, 2081)	1.0
  (0, 2163)	1.0
  (0, 3360)	1.0
  (0, 3365)	1.0
  (0, 3760)	1.0
  (0, 4629)	1.0
  (0, 4842)	1.0
  (0, 5340)	1.0
  (0, 5628)	1.0
  (0, 6167)	1.0
  (0, 6694)	1.0
  (0, 7316)	1.0
  (0, 7320)	1.0
  (1, 1038)	1.0
  (2, 501)	1.0
  (2, 1799)	1.0
  (2, 2819)	1.0
  (2, 6518)	1.0
  (3, 2294)	1.0
  (4, 5523)	1.0
  (5, 1857)	1.0
  (5, 2258)	1.0
  (5, 2303)	1.0
  (5, 4193)	1.0
  :	:
  (8188, 3460)	1.0
  (8188, 4170)	1.0
  (8188, 7063)	1.0
  (8189, 4620)	1.0
  (8190, 1884)	1.0
  (8190, 3020)	1.0
  (8190, 5410)	1.0
  (8190, 7237)	1.0
  (8191, 156)	1.0
  (8191, 490)	1.0
  (8191, 2529)	1.0
  (8191, 2974)	1.0
  (8191, 3936)	1.0
  (8191, 4466)	1.0
  (8191, 4881)	1.0
  (8191, 5571)	1.0
  (8191, 6202)	1.0
  (8191, 6354)	1.0
  (8191, 6753)	1.0
  (8191, 7061)	1.0
  (8191, 7128)	1.0
  (8191, 7331)	1.0
  (8191, 7826)	1.0
  (8191, 7876)	1.0
  (8191, 8140)	1.0
M:  8192
overall time:  0.4430725574493408
