Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (256, 256)
TEST INDEX SHAPE AFTER SPLICE: (256, 602)
  (6, 97)	1.0
  (9, 74)	1.0
  (16, 108)	1.0
  (16, 109)	1.0
  (16, 125)	1.0
  (17, 91)	1.0
  (22, 135)	1.0
  (22, 193)	1.0
  (28, 184)	1.0
  (28, 193)	1.0
  (31, 148)	1.0
  (33, 42)	1.0
  (42, 33)	1.0
  (52, 110)	1.0
  (55, 182)	1.0
  (74, 9)	1.0
  (91, 17)	1.0
  (97, 6)	1.0
  (108, 16)	1.0
  (109, 16)	1.0
  (110, 52)	1.0
  (125, 16)	1.0
  (135, 22)	1.0
  (135, 160)	1.0
  (135, 217)	1.0
  (143, 184)	1.0
  (144, 234)	1.0
  (147, 216)	1.0
  (148, 31)	1.0
  (152, 237)	1.0
  (156, 165)	1.0
  (156, 253)	1.0
  (160, 135)	1.0
  (161, 183)	1.0
  (165, 156)	1.0
  (182, 55)	1.0
  (183, 161)	1.0
  (184, 28)	1.0
  (184, 143)	1.0
  (193, 22)	1.0
  (193, 28)	1.0
  (216, 147)	1.0
  (217, 135)	1.0
  (232, 234)	1.0
  (234, 144)	1.0
  (234, 232)	1.0
  (237, 152)	1.0
  (253, 156)	1.0
M:  256
overall time:  0.08469533920288086
