Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (512, 512)
TEST INDEX SHAPE AFTER SPLICE: (512, 602)
  (2, 501)	1.0
  (6, 97)	1.0
  (9, 74)	1.0
  (16, 108)	1.0
  (16, 109)	1.0
  (16, 125)	1.0
  (16, 486)	1.0
  (16, 506)	1.0
  (17, 91)	1.0
  (22, 135)	1.0
  (22, 193)	1.0
  (28, 184)	1.0
  (28, 193)	1.0
  (28, 440)	1.0
  (29, 377)	1.0
  (31, 148)	1.0
  (33, 42)	1.0
  (35, 428)	1.0
  (41, 404)	1.0
  (42, 33)	1.0
  (52, 110)	1.0
  (55, 182)	1.0
  (74, 9)	1.0
  (91, 17)	1.0
  (93, 277)	1.0
  :	:
  (414, 132)	1.0
  (426, 398)	1.0
  (428, 35)	1.0
  (428, 182)	1.0
  (428, 358)	1.0
  (428, 487)	1.0
  (440, 28)	1.0
  (445, 137)	1.0
  (455, 333)	1.0
  (464, 478)	1.0
  (469, 252)	1.0
  (478, 144)	1.0
  (478, 464)	1.0
  (478, 490)	1.0
  (486, 16)	1.0
  (487, 274)	1.0
  (487, 428)	1.0
  (490, 156)	1.0
  (490, 165)	1.0
  (490, 478)	1.0
  (500, 327)	1.0
  (501, 2)	1.0
  (502, 156)	1.0
  (502, 348)	1.0
  (506, 16)	1.0
M:  512
overall time:  0.09031200408935547
