Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (128, 128)
TEST INDEX SHAPE AFTER SPLICE: (128, 602)
  (6, 97)	1.0
  (9, 74)	1.0
  (16, 108)	1.0
  (16, 109)	1.0
  (16, 125)	1.0
  (17, 91)	1.0
  (33, 42)	1.0
  (42, 33)	1.0
  (52, 110)	1.0
  (74, 9)	1.0
  (91, 17)	1.0
  (97, 6)	1.0
  (108, 16)	1.0
  (109, 16)	1.0
  (110, 52)	1.0
  (125, 16)	1.0
M:  128
overall time:  0.07767033576965332
