Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (32768, 32768)
TEST INDEX SHAPE AFTER SPLICE: (32768, 602)
  (0, 664)	1.0
  (0, 2081)	1.0
  (0, 2163)	1.0
  (0, 3360)	1.0
  (0, 3365)	1.0
  (0, 3760)	1.0
  (0, 4629)	1.0
  (0, 4842)	1.0
  (0, 5340)	1.0
  (0, 5628)	1.0
  (0, 6167)	1.0
  (0, 6694)	1.0
  (0, 7316)	1.0
  (0, 7320)	1.0
  (0, 8594)	1.0
  (0, 8626)	1.0
  (0, 8741)	1.0
  (0, 9708)	1.0
  (0, 10451)	1.0
  (0, 11393)	1.0
  (0, 12361)	1.0
  (0, 12699)	1.0
  (0, 13913)	1.0
  (0, 14170)	1.0
  (0, 14279)	1.0
  :	:
  (32766, 23711)	1.0
  (32766, 24379)	1.0
  (32767, 2070)	1.0
  (32767, 3690)	1.0
  (32767, 4580)	1.0
  (32767, 5421)	1.0
  (32767, 6501)	1.0
  (32767, 7566)	1.0
  (32767, 7772)	1.0
  (32767, 8426)	1.0
  (32767, 9352)	1.0
  (32767, 9417)	1.0
  (32767, 10078)	1.0
  (32767, 12965)	1.0
  (32767, 16140)	1.0
  (32767, 18794)	1.0
  (32767, 19414)	1.0
  (32767, 19712)	1.0
  (32767, 21419)	1.0
  (32767, 22052)	1.0
  (32767, 22303)	1.0
  (32767, 22881)	1.0
  (32767, 25896)	1.0
  (32767, 26341)	1.0
  (32767, 32719)	1.0
M:  32768
overall time:  1.6654484272003174
