Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (16384, 16384)
TEST INDEX SHAPE AFTER SPLICE: (16384, 602)
  (0, 664)	1.0
  (0, 2081)	1.0
  (0, 2163)	1.0
  (0, 3360)	1.0
  (0, 3365)	1.0
  (0, 3760)	1.0
  (0, 4629)	1.0
  (0, 4842)	1.0
  (0, 5340)	1.0
  (0, 5628)	1.0
  (0, 6167)	1.0
  (0, 6694)	1.0
  (0, 7316)	1.0
  (0, 7320)	1.0
  (0, 8594)	1.0
  (0, 8626)	1.0
  (0, 8741)	1.0
  (0, 9708)	1.0
  (0, 10451)	1.0
  (0, 11393)	1.0
  (0, 12361)	1.0
  (0, 12699)	1.0
  (0, 13913)	1.0
  (0, 14170)	1.0
  (0, 14279)	1.0
  :	:
  (16379, 14058)	1.0
  (16380, 141)	1.0
  (16380, 2555)	1.0
  (16380, 5579)	1.0
  (16380, 7599)	1.0
  (16380, 9904)	1.0
  (16380, 10439)	1.0
  (16380, 10759)	1.0
  (16380, 11963)	1.0
  (16380, 11964)	1.0
  (16380, 12126)	1.0
  (16380, 14276)	1.0
  (16380, 14455)	1.0
  (16380, 15958)	1.0
  (16381, 7599)	1.0
  (16381, 10759)	1.0
  (16381, 12126)	1.0
  (16381, 14276)	1.0
  (16381, 15588)	1.0
  (16382, 14841)	1.0
  (16383, 682)	1.0
  (16383, 3078)	1.0
  (16383, 4274)	1.0
  (16383, 8295)	1.0
  (16383, 15111)	1.0
M:  16384
overall time:  0.8532249927520752
