Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 602)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 602)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 232965)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 256)          154112      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 41)           10496       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 164,608
Trainable params: 164,608
Non-trainable params: 0
__________________________________________________________________________________________________
232965
TEST INDEX SHAPE BEFORE SPLICE: (55334, 602)
ADJ MATRIX BEFORE (55334, 55334)
ADJ MATRIX AFTER (55333, 55333)
TEST INDEX SHAPE AFTER SPLICE: (55333, 602)
  (0, 664)	1.0
  (0, 2081)	1.0
  (0, 2163)	1.0
  (0, 3360)	1.0
  (0, 3365)	1.0
  (0, 3760)	1.0
  (0, 4629)	1.0
  (0, 4842)	1.0
  (0, 5340)	1.0
  (0, 5628)	1.0
  (0, 6167)	1.0
  (0, 6694)	1.0
  (0, 7316)	1.0
  (0, 7320)	1.0
  (0, 8594)	1.0
  (0, 8626)	1.0
  (0, 8741)	1.0
  (0, 9708)	1.0
  (0, 10451)	1.0
  (0, 11393)	1.0
  (0, 12361)	1.0
  (0, 12699)	1.0
  (0, 13913)	1.0
  (0, 14170)	1.0
  (0, 14279)	1.0
  :	:
  (55332, 2372)	1.0
  (55332, 2563)	1.0
  (55332, 3516)	1.0
  (55332, 4142)	1.0
  (55332, 6620)	1.0
  (55332, 6879)	1.0
  (55332, 10083)	1.0
  (55332, 11791)	1.0
  (55332, 11862)	1.0
  (55332, 13417)	1.0
  (55332, 14394)	1.0
  (55332, 16413)	1.0
  (55332, 16564)	1.0
  (55332, 18158)	1.0
  (55332, 23765)	1.0
  (55332, 26024)	1.0
  (55332, 29091)	1.0
  (55332, 35959)	1.0
  (55332, 38665)	1.0
  (55332, 39107)	1.0
  (55332, 45127)	1.0
  (55332, 45721)	1.0
  (55332, 47002)	1.0
  (55332, 48880)	1.0
  (55332, 50090)	1.0
M:  55333
overall time:  2.750844955444336
